{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 32,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 32
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 3,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[UNK]": 2,
      "[PAD]": 3,
      "\u0003": 4,
      "\u0004": 5,
      "\b": 6,
      "\u001a": 7,
      " ": 8,
      "!": 9,
      "\"": 10,
      "#": 11,
      "$": 12,
      "%": 13,
      "&": 14,
      "'": 15,
      "(": 16,
      ")": 17,
      "*": 18,
      "+": 19,
      ",": 20,
      "-": 21,
      ".": 22,
      "/": 23,
      "0": 24,
      "1": 25,
      "2": 26,
      "3": 27,
      "4": 28,
      "5": 29,
      "6": 30,
      "7": 31,
      "8": 32,
      "9": 33,
      ":": 34,
      ";": 35,
      "<": 36,
      "=": 37,
      ">": 38,
      "?": 39,
      "@": 40,
      "A": 41,
      "B": 42,
      "C": 43,
      "D": 44,
      "E": 45,
      "F": 46,
      "G": 47,
      "H": 48,
      "I": 49,
      "J": 50,
      "K": 51,
      "L": 52,
      "M": 53,
      "N": 54,
      "O": 55,
      "P": 56,
      "Q": 57,
      "R": 58,
      "S": 59,
      "T": 60,
      "U": 61,
      "V": 62,
      "W": 63,
      "X": 64,
      "Y": 65,
      "Z": 66,
      "[": 67,
      "\\": 68,
      "]": 69,
      "^": 70,
      "_": 71,
      "`": 72,
      "a": 73,
      "b": 74,
      "c": 75,
      "d": 76,
      "e": 77,
      "f": 78,
      "g": 79,
      "h": 80,
      "i": 81,
      "j": 82,
      "k": 83,
      "l": 84,
      "m": 85,
      "n": 86,
      "o": 87,
      "p": 88,
      "q": 89,
      "r": 90,
      "s": 91,
      "t": 92,
      "u": 93,
      "v": 94,
      "w": 95,
      "x": 96,
      "y": 97,
      "z": 98,
      "{": 99,
      "|": 100,
      "}": 101,
      "~": 102,
      "": 103,
      "": 104,
      "": 105,
      " ": 106,
      "¡": 107,
      "¢": 108,
      "£": 109,
      "¤": 110,
      "¥": 111,
      "¦": 112,
      "§": 113,
      "¨": 114,
      "©": 115,
      "ª": 116,
      "«": 117,
      "¬": 118,
      "®": 119,
      "¯": 120,
      "°": 121,
      "±": 122,
      "²": 123,
      "³": 124,
      "´": 125,
      "µ": 126,
      "¶": 127,
      "·": 128,
      "¸": 129,
      "¹": 130,
      "º": 131,
      "»": 132,
      "½": 133,
      "¿": 134,
      "À": 135,
      "Á": 136,
      "Â": 137,
      "Ã": 138,
      "Ä": 139,
      "Å": 140,
      "Æ": 141,
      "Ç": 142,
      "É": 143,
      "Ê": 144,
      "Ë": 145,
      "Ì": 146,
      "Í": 147,
      "Î": 148,
      "Ï": 149,
      "Ñ": 150,
      "Ò": 151,
      "Ó": 152,
      "Ô": 153,
      "Õ": 154,
      "Ö": 155,
      "×": 156,
      "Ø": 157,
      "Ü": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ă": 193,
      "ą": 194,
      "ć": 195,
      "Ċ": 196,
      "Č": 197,
      "č": 198,
      "Đ": 199,
      "đ": 200,
      "ę": 201,
      "Ě": 202,
      "ě": 203,
      "Ğ": 204,
      "ğ": 205,
      "ĩ": 206,
      "Ī": 207,
      "İ": 208,
      "ı": 209,
      "ĸ": 210,
      "ľ": 211,
      "Ł": 212,
      "ł": 213,
      "ő": 214,
      "Œ": 215,
      "œ": 216,
      "Ř": 217,
      "ř": 218,
      "Ś": 219,
      "ś": 220,
      "Ş": 221,
      "ş": 222,
      "Š": 223,
      "š": 224,
      "ť": 225,
      "ū": 226,
      "ů": 227,
      "ű": 228,
      "Ÿ": 229,
      "ź": 230,
      "ż": 231,
      "Ž": 232,
      "ž": 233,
      "ƒ": 234,
      "ơ": 235,
      "ư": 236,
      "ș": 237,
      "ț": 238,
      "ɮ": 239,
      "ˆ": 240,
      "˓": 241,
      "˹": 242,
      "˿": 243,
      "̀": 244,
      "́": 245,
      "̃": 246,
      "̉": 247,
      "͓": 248,
      "͔": 249,
      "Α": 250,
      "Γ": 251,
      "Ε": 252,
      "Η": 253,
      "Θ": 254,
      "Ι": 255,
      "Κ": 256,
      "Λ": 257,
      "Μ": 258,
      "Ν": 259,
      "Ο": 260,
      "Π": 261,
      "Ρ": 262,
      "Σ": 263,
      "Τ": 264,
      "Υ": 265,
      "Χ": 266,
      "Ϊ": 267,
      "α": 268,
      "β": 269,
      "γ": 270,
      "δ": 271,
      "ε": 272,
      "ζ": 273,
      "η": 274,
      "θ": 275,
      "ι": 276,
      "κ": 277,
      "λ": 278,
      "μ": 279,
      "ν": 280,
      "ξ": 281,
      "ο": 282,
      "π": 283,
      "ρ": 284,
      "ς": 285,
      "σ": 286,
      "τ": 287,
      "υ": 288,
      "φ": 289,
      "χ": 290,
      "ψ": 291,
      "ω": 292,
      "А": 293,
      "Г": 294,
      "Д": 295,
      "Е": 296,
      "З": 297,
      "И": 298,
      "К": 299,
      "Л": 300,
      "Н": 301,
      "Ф": 302,
      "Ц": 303,
      "Ч": 304,
      "Ы": 305,
      "Ь": 306,
      "Я": 307,
      "а": 308,
      "б": 309,
      "в": 310,
      "г": 311,
      "д": 312,
      "е": 313,
      "ж": 314,
      "з": 315,
      "и": 316,
      "й": 317,
      "к": 318,
      "л": 319,
      "м": 320,
      "н": 321,
      "о": 322,
      "п": 323,
      "р": 324,
      "с": 325,
      "т": 326,
      "у": 327,
      "ф": 328,
      "х": 329,
      "ц": 330,
      "ч": 331,
      "ш": 332,
      "щ": 333,
      "ъ": 334,
      "ы": 335,
      "ь": 336,
      "э": 337,
      "ю": 338,
      "я": 339,
      "ђ": 340,
      "є": 341,
      "ѕ": 342,
      "ј": 343,
      "џ": 344,
      "ѹ": 345,
      "Ѽ": 346,
      "Ҋ": 347,
      "ү": 348,
      "ҹ": 349,
      "Ҿ": 350,
      "ә": 351,
      "ը": 352,
      "א": 353,
      "ב": 354,
      "ג": 355,
      "ד": 356,
      "ה": 357,
      "ו": 358,
      "ז": 359,
      "ח": 360,
      "ט": 361,
      "י": 362,
      "ך": 363,
      "כ": 364,
      "ל": 365,
      "ם": 366,
      "מ": 367,
      "ן": 368,
      "נ": 369,
      "ס": 370,
      "ע": 371,
      "ף": 372,
      "פ": 373,
      "ץ": 374,
      "צ": 375,
      "ק": 376,
      "ר": 377,
      "ש": 378,
      "ת": 379,
      "،": 380,
      "ؘ": 381,
      "؟": 382,
      "ء": 383,
      "آ": 384,
      "أ": 385,
      "ؤ": 386,
      "إ": 387,
      "ئ": 388,
      "ا": 389,
      "ب": 390,
      "ة": 391,
      "ت": 392,
      "ث": 393,
      "ج": 394,
      "ح": 395,
      "خ": 396,
      "د": 397,
      "ذ": 398,
      "ر": 399,
      "ز": 400,
      "س": 401,
      "ش": 402,
      "ص": 403,
      "ض": 404,
      "ط": 405,
      "ظ": 406,
      "ع": 407,
      "غ": 408,
      "ف": 409,
      "ق": 410,
      "ك": 411,
      "ل": 412,
      "م": 413,
      "ن": 414,
      "ه": 415,
      "و": 416,
      "ى": 417,
      "ي": 418,
      "ً": 419,
      "َ": 420,
      "ِ": 421,
      "ی": 422,
      "۶": 423,
      "క": 424,
      "గ": 425,
      "బ": 426,
      "ల": 427,
      "ూ": 428,
      "ో": 429,
      "ก": 430,
      "ข": 431,
      "ฃ": 432,
      "ค": 433,
      "ฆ": 434,
      "ง": 435,
      "จ": 436,
      "ฉ": 437,
      "ช": 438,
      "ซ": 439,
      "ฌ": 440,
      "ญ": 441,
      "ฎ": 442,
      "ฏ": 443,
      "ฐ": 444,
      "ฑ": 445,
      "ฒ": 446,
      "ณ": 447,
      "ด": 448,
      "ต": 449,
      "ถ": 450,
      "ท": 451,
      "ธ": 452,
      "น": 453,
      "บ": 454,
      "ป": 455,
      "ผ": 456,
      "ฝ": 457,
      "พ": 458,
      "ฟ": 459,
      "ภ": 460,
      "ม": 461,
      "ย": 462,
      "ร": 463,
      "ฤ": 464,
      "ล": 465,
      "ฦ": 466,
      "ว": 467,
      "ศ": 468,
      "ษ": 469,
      "ส": 470,
      "ห": 471,
      "ฬ": 472,
      "อ": 473,
      "ฮ": 474,
      "ฯ": 475,
      "ะ": 476,
      "ั": 477,
      "า": 478,
      "ำ": 479,
      "ิ": 480,
      "ี": 481,
      "ึ": 482,
      "ื": 483,
      "ุ": 484,
      "ู": 485,
      "ฺ": 486,
      "฿": 487,
      "เ": 488,
      "แ": 489,
      "โ": 490,
      "ใ": 491,
      "ไ": 492,
      "ๅ": 493,
      "ๆ": 494,
      "็": 495,
      "่": 496,
      "้": 497,
      "๊": 498,
      "๋": 499,
      "์": 500,
      "ํ": 501,
      "๐": 502,
      "๑": 503,
      "๒": 504,
      "๓": 505,
      "๔": 506,
      "๕": 507,
      "๖": 508,
      "๗": 509,
      "๘": 510,
      "๙": 511,
      "๛": 512,
      "་": 513,
      "ད": 514,
      "མ": 515,
      "ི": 516,
      "ེ": 517,
      "ྲ": 518,
      "က": 519,
      "ခ": 520,
      "င": 521,
      "စ": 522,
      "ည": 523,
      "တ": 524,
      "ထ": 525,
      "န": 526,
      "ပ": 527,
      "ယ": 528,
      "ရ": 529,
      "သ": 530,
      "အ": 531,
      "ာ": 532,
      "ူ": 533,
      "ေ": 534,
      "့": 535,
      "း": 536,
      "္": 537,
      "်": 538,
      "၆": 539,
      "။": 540,
      "ၾ": 541,
      "႑": 542,
      "ა": 543,
      "გ": 544,
      "დ": 545,
      "ე": 546,
      "ი": 547,
      "მ": 548,
      "ნ": 549,
      "ო": 550,
      "ს": 551,
      "ấ": 552,
      "ẩ": 553,
      "ẹ": 554,
      "ẻ": 555,
      "ẽ": 556,
      "ị": 557,
      "ọ": 558,
      "ỏ": 559,
      "ố": 560,
      "Ổ": 561,
      "ổ": 562,
      "ỗ": 563,
      "ớ": 564,
      "ỳ": 565,
      "‎": 566,
      "‏": 567,
      "–": 568,
      "—": 569,
      "‗": 570,
      "‘": 571,
      "’": 572,
      "“": 573,
      "”": 574,
      "†": 575,
      "•": 576,
      "…": 577,
      "‰": 578,
      "‿": 579,
      "₧": 580,
      "€": 581,
      "ℓ": 582,
      "№": 583,
      "™": 584,
      "↓": 585,
      "∂": 586,
      "∆": 587,
      "│": 588,
      "║": 589,
      "╥": 590,
      "╨": 591,
      "╩": 592,
      "▁": 593,
      "█": 594,
      "▌": 595,
      "▒": 596,
      "▬": 597,
      "▼": 598,
      "○": 599,
      "●": 600,
      "◕": 601,
      "◙": 602,
      "★": 603,
      "☜": 604,
      "☞": 605,
      "☺": 606,
      "☻": 607,
      "☼": 608,
      "♂": 609,
      "♠": 610,
      "♣": 611,
      "♥": 612,
      "♦": 613,
      "♫": 614,
      "❤": 615,
      "【": 616,
      "】": 617,
      "え": 618,
      "こ": 619,
      "ち": 620,
      "づ": 621,
      "に": 622,
      "は": 623,
      "べ": 624,
      "ぽ": 625,
      "ん": 626,
      "ㄓ": 627,
      "ㄴ": 628,
      "ㄷ": 629,
      "ㅁ": 630,
      "ㅊ": 631,
      "ㅋ": 632,
      "ㅐ": 633,
      "ㅕ": 634,
      "ㅠ": 635,
      "ㅣ": 636,
      "㝔": 637,
      "㤢": 638,
      "䬳": 639,
      "东": 640,
      "中": 641,
      "你": 642,
      "使": 643,
      "保": 644,
      "到": 645,
      "唔": 646,
      "墾": 647,
      "存": 648,
      "孵": 649,
      "宆": 650,
      "寯": 651,
      "尐": 652,
      "年": 653,
      "底": 654,
      "我": 655,
      "推": 656,
      "文": 657,
      "日": 658,
      "氣": 659,
      "淘": 660,
      "牙": 661,
      "番": 662,
      "的": 663,
      "空": 664,
      "箮": 665,
      "聽": 666,
      "荐": 667,
      "西": 668,
      "샤": 669,
      "（": 670,
      "）": 671,
      "０": 672,
      "１": 673,
      "２": 674,
      "３": 675,
      "５": 676,
      "６": 677,
      "７": 678,
      "８": 679,
      "９": 680,
      "ｈ": 681,
      "ｉ": 682,
      "ｎ": 683,
      "ｐ": 684,
      "ｗ": 685,
      "ｘ": 686,
      "｡": 687,
      "ｱ": 688,
      "ｲ": 689,
      "ｴ": 690,
      "ｵ": 691,
      "ｺ": 692,
      "ｼ": 693,
      "ｾ": 694,
      "ｿ": 695,
      "ﾁ": 696,
      "ﾄ": 697,
      "ﾅ": 698,
      "ﾇ": 699,
      "ﾉ": 700,
      "ﾋ": 701,
      "ﾏ": 702,
      "ﾐ": 703,
      "ﾓ": 704,
      "ﾕ": 705,
      "ﾖ": 706,
      "ﾗ": 707,
      "ﾘ": 708,
      "ﾜ": 709,
      "ﾝ": 710,
      "�": 711,
      "񥯮": 712,
      "񯡢": 713
    },
    "merges": []
  }
}